Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Перемещение полей между областями возможно с помощью Drag-and-Drop.
en: The Drag-and-Drop method enables to move fields beween areas.

source: Переобучение Цикла самого верхнего уровня приведет к переобучению всех вложенных узлов и Подмоделей.
en: The Loop retraining of the highest level will cause retraining of all nested nodes and Supernodes.

source: Переобучение особенно необходимо в тех случаях, когда набор данных изменяется и требуется перестроить Модель на новых данных.
en: Retraining is particularly important in the cases when the data set is changed, and it is required to retrain the Model on the new data basis.

source: Переопределить настройки портов возможно, однако, следует иметь в виду, что перенастройка входных портов может привести к несоответствию новых входных данных требованиям сценария, унаследованного от базового узла, и, как следствие, к ошибке выполнения.
en: It is possible to redefine settings of ports, however, it should be noted that reconfiguration of the input ports can cause incompliance of the new input data with the requirements of the workflow inherited from the base node, and, as a consequence, execution error.

source: Перетаскиванием внутри списка можно менять позицию в выделенных полей.
en: It is possible to change position in the selected fields by dragging inside the list.

source: Перетаскиванием мыши (Drag-and-drop);
en: by drag-and-drop method;

source: Перетащить запись из списка Поля сортировки в Доступные поля;
en: to drag the record from Sort fields list to Available fields;

source: Перетащить элемент из списка Выбранные элементы в Доступные элементы;
en: Drag the item from the Selected items list to the Available items list.

source: Переход внутрь папки осуществляется двойным кликом курсора по ней, а переход в папку уровнем выше — двойным кликом по кнопке .. .
en: The double cursor click on the folder is used to move inside this folder. To move to the folder one level up, it is required to double click .. button.

source: Перечень возможных операций представлен палитрой готовых компонентов.
en: A list of possible operations is represented by a number of ready components.

source: Перечень запрещенных изменений при переопределении производного узла приведен ниже.
en: The list of the changes prohibited in the case of the derived node overdetermination is provided below.

source: Перечень запрещенных изменений при переопределении производного узла:
en: The list of the changes prohibited in the case of the derived node overdetermination:

source: Перечень и назначение маркеров:
en: List and Designation of Markers:

source: Перечень и параметры переменных определяются при настройке входных портов обработчика.
en: The list and parameters of variables are defined when configuring input ports of the handler.

source: Перечень и параметры полей/переменных определяются при настройке входных портов обработчика.
en: The list and features of fields/variables are defined when configuring input ports of the handler.

source: Перечень назначений, которые может принимать параметр, индивидуален для каждого обработчика.
en: A list of the feature usage types is compiled on an individual basis for each handler.

source: Перечень полей таких узлов может быть переменным, зависящим от входных данных.
en: List of fields of such nodes can be variable according to the input data.

source: Перечисленные алгоритмы используют различные параметры настроек нормализации:
en: Different parameters of the normalization settings are used by the listed algorithms:

source: Перечисленные опции доступны для различных методов:
en: The following options are available for different methods:

source: Период сглаживания - значение вещественного типа в диапазоне 2, 20000 с шагом 0.1.
en: The smoothing period: the real value in the range of 2, 20000 at 0.1 intervals.

source: Периодическое;
en: Periodic

source: Персона - главная таблица и присоединяемая Город.
en: A person - the main table and joined City.

source: Персона - главная таблица и присоединяемою Город.
en: A person - the main table and joined City.

source: Персона - главная таблица, и две присоединяемых: Город и Регион.
en: A person - the main table and two joined: City and District.

source: Персональные редакции (Community, Personal)
en: Personal Editions (Community, Personal)

source: Песчаная.
en: Sand.

source: Пирсона
en: coefficient

source: Платформа Loginom предлагается в 5-ти редакциях:
en: 5 editions of Loginom Platform are available:

source: Платформа Loginom предоставляет возможность интеграции с SOAP или REST сервисами.
en: The Loginom platform provides integration with SOAP or REST services.

source: Плитка
en: Tiles

source: Плитка — пользователь выбирает количество интервалов, а компонент задает диапазоны интервалов таким образом, чтобы в каждом интервале было примерно одинаковое количество значений.
en: Tile: a user selects count of bins and the component enables to set bin ranges in such a way that provides approximately the same number of values in each bin.

source: Плохо
en: Poor

source: Пн
en: Monday

source: По умолчанию — 3.
en: By default — 3.

source: По умолчанию равно 1, что означает: каждый рекурсивный узел будет раскрыт автоматически, но рекурсивные узлы внутри этих узлов останутся нераскрытыми.
en: By default, it is equal to 1. It means that every recursive node will be automatically opened but recursive nodes inside these nodes will be left unopened.

source: По верхнему краю;
en: Align top

source: По возможности, при преобразовании типа сохраняется полнота информации, но в некоторых случаях изменение типа может привести к потере информации.
en: As far as possible, when transforming, information completeness is preserved but in some cases, type change can cause loss of information.

source: По горизонтальной его оси откладываются значения независимого столбца, а по вертикальной — соответствующие им значения зависимого столбца.
en: The independent column values are set on its horizontal axis, and the dependent column values that comply with them are set on its vertical axis.

source: По данным полям можно отсортировать список по возрастанию , по убыванию либо отменить сортировку.
en: It is possible to sort the list for these fields in ascending order , in descending order , or to cancel sorting.

source: По желанию к меткам дополненных полей можно добавить префиксы.
en: Prefixes can be optionally added to the captions of the appended fields.

source: По желанию к меткам полей присоединяемых таблиц можно добавить префиксы.
en: Prefixes can be optionally added to the field captions of the joined tables.

source: По завершении всех рестартов выбирается сеть, которая обеспечивает наименьшую среднеквадратическую ошибку на обучающем множестве.
en: Upon completion of all restarts, it is required to select the network that provides the least root-mean-square error of the training set.

source: По значению.
en: By value.

source: По кнопке Предпросмотр… в отдельном окне выводится до 100 первых строк результирующего набора данных и консоль отладки кода.
en: Preview… button enables to show up to 100 first strings of the resulting data set and console of code debugging in a separate window.

source: По левому краю;
en: Align left

source: По нажатию кнопки Выйти из подмодели Выйти из подмодели происходит выход из Подмодели в сценарий на уровень выше.
en: When pressing Move out Move out button, it is possible to move out the Supernode to the workflow a level higher.

source: По нажатию на Поделиться Поделиться… открывается окно с одним или двумя путями:
en: Pressing Share Share…, it is possible to open a window with one or two paths:

source: По нижнему краю.
en: Align bottom

source: По отдельности они не представляют интереса и предназначены для использования внутри подключенного Пакета.
en: Separately they are of no interest and are designated for use in the connected Package.

source: По полю Количество продаж выберем функцию агрегации Сумма.
en: Let's select the Sum aggregation function by the Volume of sales field.

source: По правому краю;
en: Align right

source: По середине;
en: Align middle

source: По указанному имени производится поиск существующего пользователя на Loginom сервере;
en: The current user is searched for by the specified name on the Loginom server.

source: По умолчанию 389 для обычного соединения или 636 для SSL соединения.| |Безопасность соединения|Обычное соединение|Позволяет задать защищенное (SSL/TLS) соединение к LDAP по специальному порту (636 по умолчанию) или получение защищенного соединения (STARTTLS) на обычном порту через STARTTLS.
en: 389 for the normal connection by default or 636 for the SSL connection.| |Connection security|Normal connection|It enables to set secure (SSL/TLS) connection to LDAP via the special port (636 by default) or provide secure connection (STARTTLS) for the normal port via STARTTLS.

source: По умолчанию port 9000, database default.
en: By default, port 9000, default database.

source: По умолчанию default.
en: By default, default.

source: По умолчанию = 0,01.
en: By default = 0.01.

source: По умолчанию = 0,01;
en: By default = 0.01.

source: По умолчанию в окне Предпросмотра окно вывода сообщений консоли свернуто.
en: By default, the message console window in the Preview window is collapsed.

source: По умолчанию в текст исполняемого узлом кода добавляется строка импорта этих объектов.
en: The import string of these objects is added to the text of the code executed by the node by default.

source: По умолчанию версия равна 1.0.0.
en: Version 1.0.0 is used by default.

source: По умолчанию включено.
en: Enabled by default.

source: По умолчанию выставляется значение Все пространства имен.
en: The value of All namespaces is set by default.

source: По умолчанию выставляется значение первого корневого узла выбранного файла.
en: The value of the first root node of the selected file is set by default.

source: По умолчанию данная опция выключена.
en: This option is disabled by default.

source: По умолчанию данный режим не используется.
en: This mode is not used by default.

source: По умолчанию данный режим отключен.
en: This mode is disabled by default.

source: По умолчанию для нового выражения назначается метка ВыражениеN и имя ExprN, где N — номер, обеспечивающий уникальность.
en: ExpressionN caption and ExprN name are assigned to the new expression by default where N is a number providing uniqueness.

source: По умолчанию для новых узлов обе опции включены.
en: Both options are enabled by default for new nodes.

source: По умолчанию для числовых типов выбрана функция Сумма, а для всех остальных Количество.
en: By default, the Sum function is selected for all numerical types, whereas for others - Count.

source: По умолчанию задан пустой строкой и в этом случае не производится проверка LDAP пользователей.
en: It is set by the empty string by default. In this case, the LDAP users are not checked.

source: По умолчанию значение коэффициента отталкивания установлено 2,6.
en: The default repulsion coefficient value is equal to 2.6.

source: По умолчанию имеет значение первого корневого узла выбранного файла.
en: The value of the first root node of the selected file is set by default.

source: По умолчанию информационная панель скрыта.
en: The information panel is hidden by default.

source: По умолчанию используется 4386.
en: 4386 is used by default.

source: По умолчанию используется localhost.
en: localhost is used by default.

source: По умолчанию используется Двойная кавычка (").
en: Double quote (") is used by default.

source: По умолчанию используется пустое имя и пустой пароль, что означает анонимный доступ к LDAP.| |Пароль||Пароль к служебной учетной записи на чтение из LDAP| |Базовый домен||Доменное имя каталога (ou=users,dc=domain,dc=com) в котором производится поиск пользователей| |Фильтр LDAP|(objectClass=user)|Фильтр пользователей, в котором может быть так же произведена проверка принадлежности пользователя группе.
en: Empty name and password are used by default that provides the anonymous access to LDAP.| |Password||Password for the read service account from LDAP| |Base domain||Domain name of the directory (ou=users,dc=domain,dc=com) in which users are searched for| |LDAP filter|(objectClass=user)|User filter in which it is also possible to verify user affiliation with a group.

source: По умолчанию используется символ знака вопроса ?.
en: The question mark ? is used by default.

source: По умолчанию используется строка False.
en: The False row is used by default.

source: По умолчанию используется строка True.
en: The True row is used by default.

source: По умолчанию настройки этой Подмодели унаследуются всеми подчиненными узлами.
en: By default settings of this Supernode are inherited by all subordinate nodes.

source: По умолчанию обычное (незащищенное) соединение.| |Использовать SASL|false|Использование механизма SASL с DIGEST-MD5 шифрованием пароля для аутентификации пользователя.
en: Normal (nonsecure) connection by default.| |Use SASL|false|Use SASL mechanism with DIGEST-MD5 password encryption for user authentification.

source: По умолчанию она скрыта, но ее можно закрепить.
en: It is hidden by default, but it is possibble to lock it.

source: По умолчанию опция включена.
en: This option is enabled by default.

source: По умолчанию отображаются следующие 8 показателей:
en: The following eight indicators are displayed by default:

source: По умолчанию параметр равен 0, и может изменяться от 0 до 1.
en: This parameter is equal to 0 by default, and it can vary from 0 to 1.

source: По умолчанию пароль отсутствует.
en: The password is not available by default.

source: По умолчанию поля выводятся в таблицу в том же порядке, что и в исходном наборе данных.
en: By default, the fields are shown in the table in the same order as in the source data set.

source: По умолчанию порт скрыт, для того чтобы отобразить его, необходимо воспользоваться кнопкой панели инструментов области построения Сценариев.
en: The port is hidden by default. To display it, it is required to use toolbar button of the Workflow construction area.

source: По умолчанию принимает значение Все пространства имен.
en: The value of All namespaces is set by default.

source: По умолчанию процесс автоматического подбора останавливается при невозможности найти лучшие параметры, чем уже найденные.
en: The auto selection process is stopped by default if it is not possible to find better parameters as compared with the detected ones.

source: По умолчанию пустой.
en: It is null by default.

source: По умолчанию результат операции будет равен количеству дней (целая часть) и количеству часов (дробная часть).
en: By default, the operation result will be equal to the number of days (integer part) and hours (fractional part).

source: По умолчанию ставится оператор И.
en: AND operator is set by default.

source: По умолчанию устанавливается 5%.
en: 5% is set be default.

source: По умолчанию устанавливается значение 5.
en: Value 5 is set by default.

source: По умолчанию устанавливается название, под которым данный столбец виден в исходном наборе данных.
en: The name under which this column is visible in the source data set is set by default.

source: По умолчанию флаг активен.
en: The checkbox is active by default.

source: По умолчанию шестнадцатеричные цифры записываются в верхнем регистре.
en: By default, hexadecimal digits are written in uppercase.

source: По умолчанию этот параметр отключен.
en: This parameter is disabled by default.

source: По умолчанию этот параметр отключен;
en: This parameter is disabled by default.

source: По умолчанию — 1.
en: By default — 1.

source: По умолчанию — 10.
en: By default — 10.

source: По центру расположена область построения Сценария — полотно, содержащее узлы Сценария и связи между ними.
en: The Workflow construction area is located in the centre: the area containing the Worlflow nodes and links between them.

source: По центру;
en: Align center

source: Повышенная скорость.
en: Increased speed.

source: Повышенная точность.
en: Increased accuracy.

source: Погрешность - числовое выражение, погрешность сравнения.
en: Error - the numeric expression, comparison error.

source: Под выбросами при этом подразумеваются значения данных, существенно отклоняющиеся от средних, а под экстремальными — значения, которые настолько сильно отклоняются от типичных значений, что перестают соответствовать логике исследуемых процессов и явлений.
en: The outliers mean the data values that distinctly deviate from the average ones, the extreme values mean the values that deviate from the typical values to such extent that they are not consistent with the logics of the processes and events under research anymore.

source: Под контекстом при интерактивном выполнении Сценариев понимается:
en: The context within the scope of the interactive execution of Workflows means as follows:

source: Под контекстом при пакетном выполнении Сценариев понимаются:
en: The context within the scope of the Workflows batch processing means as follows:

source: Под обязательными понимаются:
en: The required ones are as follows:

source: Под строкой состояния располагается область настройки условий фильтрации.
en: Area of the filtering criteria settings is located under the login status row.

source: Под элементами управления расположена таблица с результатами квантования выделенного поля, она содержит следующие поля:
en: The table with the binning results received for the selected field is located under control elements. It contains the following fields:

source: Подбирается структура так же, как и в предыдущем пункте.
en: The structure is selected as in the previous clause.

source: Поддерживается импорт внешних модулей JS.
en: Import of the external JS modules is supported.

source: Поддерживается выбор сразу нескольких вариантов отображения агрегации для факта.
en: Selection of several aggregation representation options at once is supported for the measure.

source: Поддерживается два типа подключения.
en: Two connection types are supported.

source: Поддерживается два типа подключения:
en: Two connection types are supported:

source: Поддерживается загрузка файлов методом Drag and Drop, т.
en: Drag and Drop file downloading is supported,

source: Поддерживается импорт DDF-файлов платформы Deductor.
en: The DDF files import from the Deductor platform is supported.

source: Поддерживается как кириллический синтаксис 1С, так и синтаксис SQL.
en: Both Cyrillic 1C and SQL syntax are supported.

source: Поддерживается несколько форматов даты/времени, в том числе форматы международных стандартов.
en: Several date/time formats are supported, including the international standards formats.

source: Поддерживаются даты с 1970 до 2106 года.
en: Dates from 1970 to 2106 are supported.

source: Поддерживаются модульные системы ES6 (ECMAScript 6) и CommonJS.
en: ES6 (ECMAScript 6) and CommonJS module systems are supported.

source: Поддерживаются описание SOAP-сервисов спецификации WSDL 1.1 и протоколы SOAP версий 1.1 и 1.2.
en: The SOAP services description, WSDL 1.1 specification and SOAP protocols, versions 1.1 and 1.2 are supported.

source: Поддерживаются следующие типы авторизации по имени пользователя и паролю:
en: The following types of authorization by username and password are supported:

source: Поддержка нескольких различных по стоимости и производительности СУБД в качестве платформы хранилища позволяет в каждом конкретном случае использовать наиболее пригодную для данного случая базу данных.
en: Support of several DBMS different in their prices and performance as the data warehouse platform enables to use the most suitable database in each specific case.

source: Подзадача, решаемая компонентом проверки адресов, может применяться как в очистке данных, так и в задачах скоринга.
en: The subtask solved by the address check component can be applied both for data cleansing and scoring tasks.

source: Подключение можно создать двумя способами:
en: Connection can be created in two ways:

source: Подключение осуществляется через OLE DB.
en: The connection is provided via OLE DB.

source: Подключение происходит аналогично подключению к БД.
en: The connection is performed similar to connection to DB.

source: Подключение происходит аналогично подключению с БД.
en: The connection is performed similar to connection to DB.

source: Подключение содержит в себе все необходимые параметры для соединения с источником данных, такие как пароль/логин, расположение источника и др.
en: The connection includes all parameters required for the data source connection, namely, password/login, source location, etc.

source: Подмодель в сценарии представлена в качестве узла, имеющего заданные пользователем входные и выходные порты.
en: The supernode in the workflow is represented as the node that has the input and output ports set by a user.

source: Подмодель принимает информацию через входные порты, производит обработку и выдает результат на выходные порты.
en: The supernode accepts information by means of input ports, performs processing and sends results to output ports.

source: Подмодель является специальным узлом, способным включать в себя другие узлы сценария.
en: The supernode is a special node that can include other workflow nodes.

source: Подобный алгоритм применяется единожды при выполнении команды "Синхронизировать поля" и постоянно при выполнении узла, если задействована опция настройки порта "Автоматическая синхронизация" (см.
en: The similar algorithm is used once when executing "Map fields" command and constantly when executing the node if port configuration option is used "Automapping" (refer to

source: Подобный подход является важным инструментом в реализации структурного подхода в проектировании сложных решений (см.
en: Such approach is an important tool used to implement the structural approach when designing complex solutions (refer to

source: Подробнее в файловом хранилище.
en: More detailed information is provided in the file storage.

source: Подробнее о параметрах полей см.
en: The detailed information on the fields features is provided in

source: Подробно о том, как включить данный визуализатор, можно прочитать в статье.
en: More detailed infomation how to enable this visualizer is provided in the article.

source: Подстрока - искомая подстрока,
en: Substring - searched substring.

source: Позволяет выбрать строки с которыми будут сравниваться значения.
en: It enables to select the rows with which values will be compared.

source: Позволяет выделить записи, которые удовлетворяют одному или нескольким условиям.
en: It enables to select the records that meet one or several criteria.

source: Позволяет выполнять фильтрацию значений факта для измерения.
en: It provides for filtration of the measure values for dimension.

source: Позволяет добавить свой факт в куб.
en: It enables to add one's own measure to the cube.

source: Позволяет задать параметры соответствующим осям диаграммы:
en: It enables to set parameters according to the chart axes:

source: Позволяет задать следующие параметры Пакета:
en: It enables to set the following parameters of the Package:

source: Позволяет менять формат отображения данных в столбцах таблицы, а также задать ширину столбца и его видимость.
en: It enables to change the data view format in the table column and then set the column width and its visibility.

source: Позволяет настроить импорт интересуемых данных из Хранилища данных.
en: It enables to configure import of the required data from the Data Warehouse.

source: Позволяет настроить параметры заранее настроенного внешнего разбиения.
en: It enables to configure parameters of the preconfigured external binning.
